<a href="https://colab.research.google.com/github/Jananid619/INT-PRO/blob/main/Untitled6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3 as sl

In [2]:
con = sl.connect('my-test.db')

In [3]:
with con:
    con.execute("""
        CREATE TABLE MOVIES (
            date INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
            moviename TEXT,
            hero TEXT,
            heroine TEXT,
            director TEXT
        );
    """)

In [4]:
sql = 'INSERT INTO MOVIES (date, moviename, hero,heroine,director) values(?, ?, ?, ?, ?)'
data = [
    (2001, 'world','john','Alice', 'raj'),
    (2002, 'hero','nag','roja', 'rajmouli'),
    (2003, 'wonderland','james','alena', 'manish')
]

In [5]:
with con:
    con.executemany(sql, data)

In [6]:
with con:
    data = con.execute("SELECT * FROM MOVIES WHERE date < 2003")
    for row in data:
        print(row)

(2001, 'world', 'john', 'Alice', 'raj')
(2002, 'hero', 'nag', 'roja', 'rajmouli')